app/controllers/accounts_controller.rb

  def index
    @accounts = current_user.accounts.all
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = 6

  def show
    @account = current_user.accounts.find(params[:id])
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = 5 AND "accounts"."id" = ? LIMIT 1  [["id", "3"]]

  def edit
    @account = current_user.accounts.find(params[:id])
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = 6 AND "accounts"."id" = ? LIMIT 1  [["id", "5"]]

  def create
    @account = current_user.accounts.new(params[:account])

    respond_to do |format|
      if @account.save
---
INSERT INTO "accounts" ("created_at", "domain", "password", "updated_at", "user_id", "username") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Wed, 25 Apr 2012 10:21:40 UTC +00:00], ["domain", "gmail"], ["password", "sharkasy"], ["updated_at", Wed, 25 Apr 2012 10:21:40 UTC +00:00], ["user_id", 5], ["username", "sharkasy"]]

  def update
    @account = current_user.accounts.find(params[:id])

    respond_to do |format|
      if @account.update_attributes(params[:account])
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = 6 AND "accounts"."id" = ? LIMIT 1  [["id", "5"]]
UPDATE "accounts" SET "username" = 'ahmed.elsharkasy@gmail.com', "password" = 'sherine2t', "domain" = 'gmail', "updated_at" = '2012-05-01 14:45:34.119222' WHERE "accounts"."id" = 5

	def labels
  @account = current_user.accounts.find(params[:id])
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = 6 AND "accounts"."id" = ? LIMIT 1  [["id", "5"]]