app/controllers/services_controller.rb

SELECT "users".* FROM "users" WHERE "users"."provider" = 'ahmed' AND "users"."uid" = 'ahmed' LIMIT 1
---
  def create
    auth = request.env["rack.auth"]
    user = User.where(:provider=>auth["provider"],:uid=> auth["uid"]).first unless auth.nil?