app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "oauth_token", "oauth_token_secret", "password", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "2"]]
---
	def authenticate
		@user = User.find(params[:id])